Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: དེ་ནི་དཔེར་ན་མའི་མངལ་དུ་རྣམ་པར་ཤེས་པ་ཞུགས་པར་གྱུར་མ་ཐག་པ་ལྟ་བུ་དང་འདི་ལྟ་སྟེ་དཔེར་ན།
en: This was like the day a consciousness enters the mother’s womb, to give an analogy.

source: སེམས་ཅན་རྣམས་ཀྱི་ལས་མངོན་པར་བསྒྲུབས་པ་ལྟ་བུ་དང་། འདི་ལྟ་སྟེ་དཔེར་ན།
en: This was like the completed karma of beings.

source: ཞིང་བཟང་པོ་དམ་པའི་ས་བོན་བཏབ་ནས་རིང་པོར་མ་ལོན་ཡང་མྱུ་གུ་སྐྱེ་བའི་རྒྱུར་གྱུར་པ་ལྟ་བུ་སྟེ།
en: This was like a day in which a seed or seedling that is the cause of an excellent sal tree is planted.

source: དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་དག་ཀྱང་འཇམ་ཞིང་ཡིད་དུ་འོང་བ་སྟེ།
en: “She attained these gentle and pleasant samādhis:

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་དུ་རྣམ་པར་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་སྣང་བ་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དུས་གསུམ་གྱི་ཚུལ་ཐམས་ཅད་ལ་འཇུག་པ་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་སྒྲོག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱུ་མཚོ་རྣམ་པར་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འཁོར་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱིས་གཟིར་བའི་སེམས་ཅན་འབྱུང་བའི་ང་རོ་རབ་ཏུ་བསྒྲགས་པས་རྣམ་པར་དམྱིགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་ནག་རྣམ་པར་སེལ་བའི་སྨོན་ལམ་གྱི་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་དང་དབྲལ་བའི་སྨོན་ལམ་གྱིས་རྣམ་པར་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་འགྲུབ་པ་ཡོངས་སུ་འབྱིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བས་མི་སྐྱོ་བའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ལམ་ལ་འཇུག་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་གནོན་པར་སྒྲུབ་པའི་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དེ་དག་ལ་སྩོགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོང་ཕྲག་བཅ་རྣམས་དེས་ཐོབ་པར་གྱུར་ཏེ།
en: the samādhi called directly perceiving all tathāgatas , the samādhi called the radiance that goes through the entire extent of all the realms , the samādhi called entry into comprehending all the ways of the three times , the samādhi called the resounding of the Dharma wheels of all the tathāgatas , the samādhi called perceiving the ocean of prayers by all the buddhas , the samādhi called the perception of the resounding of the roaring that saves beings afflicted by the suffering of saṃsāra , the samādhi called the array of prayers to dispel the darkness of all beings , the samādhi called the perception of the prayers for all beings to be free from suffering , the samādhi called the origin of the attainment of happiness by all beings , the samādhi called the essence of never wearying in ripening and guiding all beings , the samādhi called the banner of entering the path of all bodhisattvas , the samādhi of the display of reaching all the bhūmis of the bodhisattvas , and the other ten thousand gateways to samādhi.

source: དེ་ཕྲ་བ་ལ་མཉམ་པར་བཞག་པའི་སེམས་དང་། མི་གཡོ་བའི་སེམས་དང་། རབ་ཏུ་དགའ་བའི་སེམས་དང་། དབུགས་ཕྱིན་པའི་སེམས་དང་། དཔག་ཏུ་མེད་པའི་སེམས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བའི་སེམས་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤིན་ཏུ་ཟབ་པ་ལ་དམིགས་པའི་སེམས་དང་། བྱམས་པའི་རྗེས་སུ་འགྲོ་བའི་ཚུལ་རྒྱ་མཚོ་ལ་ཞུགས་པའི་སེམས་དང་། མངོན་པར་ཞེན་པ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་སེམས་དང་། འཇིག་རྟེན་གྱི་ཡུལ་ཐམས་ཅད་ལ་མི་གནས་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་འཇུག་པའི་སེམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཟུགས་དང་། ཁ་དོག་རྒྱ་མཚོས་སྣང་བར་གྱུར་པའི་སེམས་དང་། འཁྲུག་པ་མེད་པའི་སེམས་དང་། གཡོ་བ་མེད་པའི་སེམས་དང་། ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་། མཐོན་དམན་མེད་པའི་སེམས་དང་། མི་སྐྱོ་བའི་སེམས་དང་། མི་ཟློགས་པའི་སེམས་དང་། ཞུམ་པ་མེད་པའི་སེམས་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པའི་སེམས་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བའི་སེམས་དང་། ཆོས་ཐམས་ཅད་རབ་ཏུ་འབྱེད་པའི་ཚུལ་ཀྱི་རྗེས་སུ་སོང་བའི་སེམས་དང་། སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པའི་སེམས་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་སེམས་དང་། སངས་རྒྱས་རྒྱ་མཚོ་མང་པོའི་སྣང་བ་ཡོངས་སུ་སྐྱེས་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་ལ་འཇུག་པའི་སེམས་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་འཐོར་བའི་སེམས་དང་། བསོད་ནམས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་ཡང་དག་པར་སྒྲུབ་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་སྤོབས་པ་མངོན་སུམ་དུ་གྱུར་བའི་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་ཐམས་ཅད་ལ་སྣང་བ་ཐོབ་པའི་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་འཕེལ་བར་བྱེད་པའི་སེམས་དང་། ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་སེམས་དང་ལྡན་པས་ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་ཆེན་པོ་ལ་ལྷག་པར་དམྱིགས་པར་བྱ་བས་སྨོན་ལམ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས།
en: “She had a mind that rested in subtle equanimity, a mind that was unwavering, a mind that was filled with joy, a mind that was relieved, a mind that was immeasurable, a mind that followed the kalyāṇamitras, a mind that was focused on profound omniscience, a mind that had entered an ocean of the ways of kindness, a mind that had risen above all attachments, a mind that did not dwell within the scope of the world, a mind that had entered the scope of the tathāgatas, a mind that was illuminated by the forms and colors of all the buddhas, a mind that was undisturbed, a mind that was immovable, a mind that was without anger, a mind that was without instability, a mind that was without weariness, a mind that was without regression, a mind that was without dejection, a mind that understood the nature of all phenomena, a mind that had the understanding of the analysis of all phenomena, a mind that comprehended the ocean of all beings, a mind that wished to save all beings, a mind that gave rise to the illumination of the ocean of multitudes of buddhas, a mind that comprehended the ocean of prayers of all the tathāgatas, a mind that shattered the mountain of all obscurations, a mind that accomplished a vast accumulation of merit, a mind that was directed toward attaining the ten strengths of the tathāgatas, a mind that had attained the illumination of the range of all bodhisattvas, a mind that increased the accumulations of all bodhisattvas, and a mind that pervaded throughout all directions.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་དོན་དུ་མངོན་པར་སྒྲུབ་སྟེ།
en: “With an ocean of prayers as numerous as the atoms in ten buddha realms, she made the past prayers of all tathāgatas, so that she could acquire completely good great prayers and purify her own buddha realm.

source: འདི་ལྟར་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་འབྱམ་ཀླས་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཕྱི་མའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་ཕྱི་མའི་མཐའི་བསྐལ་པར་གནས་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་འགྲོ་བར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་བསྙེན་བཀུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པར་བསྒྲུབ་པ་དང་། རྣམ་པར་འཚང་རྒྱ་བར་བྱ་བས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱུན་མི་གཅོད་པར་བྱ་བའི་ཕྱིར།
en: “They included prayers to ripen and guide all realms of beings, to know the entire extent of the realm of phenomena, to comprehend the ocean of the ways of the realm of phenomena, to practice bodhisattva conduct in all buddha realms throughout future kalpas, to remain in the domain of bodhisattva conduct throughout all future kalpas, to go into the presence of all tathāgatas, to please all kalyāṇamitras, to perfectly make offerings to and be an attendant for all tathāgatas, to attain omniscient wisdom in every instant, and to have continuous bodhisattva conduct in order to attain buddhahood.

source: དེ་དག་ལ་སྩོགས་པ་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པའི་སྒོ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་སྨོན་ལམ་མངོན་པར་སྒྲུབ་པར་གྱུར་ཏོ།
en: “Through accomplishing an ocean of gateways to prayers, as numerous as the atoms in ten buddha realms, she was making the prayer for completely good bodhisattva conduct.

source: །དེའི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོས་སྔོན་གྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐུལ་བ་མཛད་དོ། །རབ་ཏུ་བསྟན་པ་མཛད་དོ། །ཡོངས་སུ་བསྟན་པ་མཛད་དོ། །རྣམ་པར་དབྱེ་བ་མཛད་དོ། །རྣམ་པར་དགྲོལ་བ་མཛད་དོ། །ཡང་དག་པར་བསྟན་པར་མཛད་དོ། །ཆུད་ཟ་བར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་རབ་ཏུ་བརྟན་པར་མཛད་དོ། །རྒྱ་ཆེན་པོར་ཁྱབ་པར་བྱ་བའི་ཕྱིར་ཤིན་ཏུ་ཡངས་པར་མཛད་དོ། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལྷུར་ལེན་པར་བྱ་བའི་ཕྱིར་རབ་ཏུ་གནས་པར་མཛད་དེ།
en: “In order for her to accomplish the completely good bodhisattva conduct and prayer, the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja encouraged her and inspired her with past roots of virtue that he taught, revealed, explained, displayed, made stable so they would not be lost, increased so that they would spread greatly, and caused to remain so that there would be dedication to omniscience.

source: དེ་ནི་འདི་ལྟ་སྟེ། ཐོག་མ་སེམས་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་བ་ཕྱིན་ཅད་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྨོན་ལམ་རྒྱ་མཚོ་གྲངས་མེད་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་རོ།
en: “This concerned the first development of her aspiration to enlightenment and her acquiring an ocean of the countless prayers of past tathāgatas.

source: །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་དེའི་ཡང་ཕ་རོལ་གྱི་བསྐལ་པ་བཅུ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་ཉི་མའི་འཁོར་ལོ་རྣམ་པར་སྣང་བའི་འོད་ཅེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་རྒྱལ་མཚན་དཔལ་གྱི་དཔལ་གྱི་གསུང་རབ་ལ་བུ་མོ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་འཕྲོ་བ་པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བ་དེ།
en: “Noble one, in a past time, ten kalpas before that, the daughter Samanta­jñānārci­padma­bhadrābhirāma­netra­śrī­candrā was following the teaching of the Tathāgata Candra­dhvaja­śrī­ketu in a world realm called Maṇi­sūrya­candra­vidyotita­prabhā.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་ཡོངས་སུ་བསྐུལ་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་པདྨོ་ལ་བཞུགས་པ་ཞིག་བཅོས་སོ།
en: The bodhisattva Samanta­bhadra instigated her to repair a broken statue of the Tathāgata seated upon a lotus.

source: །བཅོས་ནས་ཀྱང་རི་མོ་བྲིས་སོ།
en: When she had repaired it, she painted it.

source: །རི་མོ་བྲིས་ནས་ཀྱང་རིན་པོ་ཆེས་ཤིན་ཏུ་བརྒྱན་ཏོ། །དགེ་བའི་བཤེས་གཉེན་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་བརྟེན་ཏེ།
en: When she had painted it, she adorned it with jewels.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུའང་སེམས་བསྐྱེད་དོ།
en: Through following the bodhisattva Samanta­bhadra she developed the aspiration for the highest, complete enlightenment.

source: །དེ་དགེ་བའི་རྩ་བ་དེས་ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཅན་དུ་གྱུར་ཏེ།
en: “As a result of that root of merit, she became a Dharma follower free of downfalls.

source: རྟག་ཏུ་ལྷའི་དབང་པོའི་རིགས་དང་མིའི་དབང་པོའི་རིགས་སུ་སྐྱེས་པར་གྱུར་ཏོ།
en: She was always born into a family of lords of devas or a family of lords of humans.

source: །ཐམས་ཅད་དུ་ཡང་གཟུགས་མཛེས་ཤིང་སྡུག་ལ་བལྟ་ན་ཡིད་དུ་འོང་བ་དང་། ཁ་དོག་བཟང་པོ་ཤིན་ཏུ་རྒྱས་པ་དམ་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: In all her lives she had a body that was attractive and lovely to look at and had an excellent, beautiful color.

source: རྟག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དང་ཡང་བྲལ་བར་མ་གྱུར་ཏོ།
en: She always saw tathāgatas and was never separated from the bodhisattva Samanta­bhadra.

source: །དགེ་བའི་བཤེས་གཉེན་དེ་ཉིད་ཀྱིས་ཚེ་རབས་དེ་དང་དེ་དག་དུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །དྲན་པར་བྱས་སོ།
en: That bodhisattva ripened her in every lifetime and made her remember.

source: །ད་ཡང་དེས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ཡོངས་སུ་བསྙེན་བཀུར་ཏེ།
en: She always honored the bodhisattva Samanta­bhadra and was always devoted to him.

source: ཡིད་འབྱུང་བར་མ་བྱས་སོ། །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ཞེས་བྱ་བར་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་སེམས་ན་ནི།
en: “Noble one, who do you think was the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa at that time, in that time?

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Do not think that it was anyone else.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ནི། དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ཞེས་བྱ་བ་གྱུར་ཏོ།
en: It was the bodhisattva Maitreya who was Vairocana­ratna­padma­garbha­śrī­cūḍa at that time, in that time.

source: །རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བཙུན་མོ་དཔལ་གྱི་བཞིན་ཡོངས་སུ་རྒྱས་པ་ཞེས་བྱ་བ་བྱུང་བ་དེ།
en: “Noble one, who do you think was the king’s queen, Saṃpūrṇa­śrīvakrā, at that time, in that time?

source: གཞན་ཞིག་ཡིན་སྙམ་དུ་སེམས་ན་ཡང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Do not think that it was anyone else.

source: མཚན་མོའི་ལྷ་མོ་ཁོ་མའི་དྲུང་ན་འདུག་པ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་འདི་ཡིན་ནོ།
en: It was this night goddess, Praśanta­ruta­sāgara­vatī, who is before me.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེའི་དེའི་དུས་ན་རྒྱལ་བོའི་བུ་མོ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་འཕྲོ་བ།
en: “Noble one, who do you think was the king’s daughter, Samanta­jñānārci­padma­bhadrābhirāma­netra­śrī­candrā, at that time, in that time?

source: པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་པའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Do not think that it was anyone else.

source: ཁོ་མོ་ནི་དེའི་ཚེ་དུས་ན་རྒྱལ་པོའི་བུ་མོ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་འཕྲོ་བ། པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: I was at that time, in that time, the king’s daughter, Samanta­jñānārci­padma­bhadrābhirāma­netra­śrī­candrā.

source: །ཁོ་མོ་བུ་མོ་གཞོན་ནུར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དབང་པོའི་རྒྱལ་མཚན་དཔལ་གྱི་དཔལ་གྱི་གསུང་རབ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་པདྨོ་ལ་བཞུགས་པ་བཅོས་པ་དེ་ནི་ཁོ་མོའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་གྱུར་ཏོ། །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས། ཁོ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྐུལ་བ་དེ་ནི།
en: When I was a young girl in the time of the teaching of the Tathāgata Candra­dhvaja­śrī­ketu and repaired the statue of the Tathāgata seated upon a lotus, that was the cause for my highest, complete enlightenment.

source: ཁོ་མོས་བྱང་ཆུབ་ཏུ་སེམས་དང་པོ་བསྐྱེད་པ་ཡིན་ནོ། །ཁོ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོའི་དྲུང་དུ་ཕྱིན་ཏེ།
en: At that time, the bodhisattva Samanta­bhadra inspired me toward the highest, complete enlightenment, and that was my first development of that aspiration.

source: རྒྱན་གྱིས་གཏོར་ནས་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་མཐོང་བར་གྱུར་ཏེ།
en: “I went into the presence of the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja and scattered my jewelry over him and then saw the Tathāgata’s miraculous manifestations.

source: ཁོ་མོས་བཅོམ་ལྡན་འདས་དེའི་དྲུང་ནས་ཆོས་ཐོས་པར་གྱུར་པ་དེའི་ཚེ། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས་འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པ་འདི་ཐོབ་བོ།
en: Then when I heard the Dharma from that bhagavat, I attained this bodhisattva liberation called the manifestations that guide beings that appear in all worlds

source: །དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དེ་དག་ཐམས་ཅད་ཀྱང་བསྙེན་བཀུར་ཏེ།
en: “I have honored tathāgatas as numerous as the atoms in Sumeru

source: ཡོ་བྱད་དང་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་བཀུར་སྟིར་བྱས་སོ།
en: I have honored them by all the activities of offering them necessary articles and attending upon them.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་ཐོས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་ལའང་ཞུགས་པར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཁོ་མོས་རིམ་གྲོ་ཆེར་བྱས་ཏེ།
en: I have heard all the Dharma that those tathāgatas have taught, and I have followed the instructions and teachings of those tathāgatas.

source: རིམ་གྲོ་དེའི་རྣམ་པས་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་དཀྱིལ་འཁོར་དེ་དག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ།
en: I have greatly venerated those tathāgatas so that through that veneration I have seen in an instant of mind all tathāgatas, their assemblies of bodhisattvas, and all their buddha realms.

source: འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་བའི་ཁམས་དེ་ནི་འདས་པར་གྱུར། བསྐལ་པ་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་དེ་ནི་མཐར་ཕྱིན་པར་གྱུར་ནས།
en: “The world realm Vairocana­tejaḥśrī passed away, and the kalpa called Virajomaṇḍala came to an end.

source: དེའི་རྗེས་ལ་འཇིག་རྟེན་གྱི་ཁམས་ནི་རིན་ཆེན་འཁོར་ལོ་སྣ་ཚོགས་ཀྱིས་ཀླུབས་ཤིང་བརྒྱན་པ་ཞེས་བྱ། བསྐལ་པ་ནི་འོད་ཆེན་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེ་ལ་སངས་རྒྱས་ལྔ་བརྒྱ་བྱུང་བར་གྱུར་ཏོ། །དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་བསྙེན་བཀུར་ཏེ།
en: They were followed by the world realm called Maṇi­cakra­vicitra­pratimaṇḍita­vyūhā and the kalpa called Mahāprabha , in which appeared five hundred buddhas, and I honored all of them.

source: བསྐལ་པ་འོད་ཆེན་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོའི་སྤྲིན་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྐལ་པའི་དང་པོ་ལ་བྱུང་སྟེ།
en: The very first of them in the Mahāprabha kalpa was the tathāgata whose name was Mahā­karuṇa­megha­dhvaja.

source: དེ་མངོན་པར་བྱུང་བའི་ཚེ། ཁོ་མོ་མཚན་མོའི་ལྷ་མོར་གྱུར་པས་མཆོད་པ་བྱས་སོ།
en: When he set forth into homelessness, I was a night goddess who made offerings to him.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་མཐུ་བོ་ཆེའི་དཔལ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Vajra­nārāyaṇa­ketu.

source: དེ་ལ་ཁོ་མོའཁོར་ལོས་སྒྱུར་བར་གྱུར་པས་མཆོད་པ་བྱས་སོ།
en: I was a cakravartin who made offerings to him.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་སངས་རྒྱས་ཐམས་ཅད་སྐྱེ་ཞིང་འབྱུང་བ་ཞེས་བྱ་བ། མདོ་སྔེ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Birth and Arising of All Buddhas , together with accompanying sūtras as numerous as the atoms in ten buddha realms.

source: དེ་ཡང་ཁོ་མོས་ཐོས་ནས་ཡོངས་སུ་བཟུང་ངོ་།
en: I heard it and retained it.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མེའི་འོད་འཕྲོ་རིའི་དཔལ་གྱིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་བྱུང་སྟེ་དེ་ལ་ཁོ་མོ་ཚོང་དཔོན་གྱི་བུ་མོར་གྱུར་པས་མཆོད་པ་བྱས་སོ།
en: “After that, there was the tathāgata whose name was Jvalanārciḥ­parvata­śrī­vyūha. I was a head merchant’s daughter and made offerings to him.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་དུས་གསུམ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བ། མདོ་སྡེ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Essence of the Light of the Three Times , together with accompanying sūtras as numerous as the atoms in Jambudvīpa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པའི་ཤུགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Sarva­dharma­samudrābhyudgata­vega­rāja.

source: དེ་ལ་ཁོ་མོ་ལྷའི་རྒྱལ་པོར་གྱུར་པས་མཆོད་པ་བྱས་སོ།
en: I was a king of devas and made offerings to him.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཐམས་ཅད་ཤེས་པའི་བྱེ་བྲག་ཅེས་བྱ་བ་མདོ་སྡེ་ལྔ་བརྒྱའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Categories of the Knowledge of All the Bases of the Realm of Phenomena , together with five hundred accompanying sūtras.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཟབ་མོའི་དཔལ་རྒྱ་མཚོས་ཡང་དག་པར་འབྱུང་བའི་འོད་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Gambhīra­dharma­śrī­samudra­prabha.

source: དེ་ལ་ཁོ་མོ་ཀླུའི་དབང་པོའི་བུ་མོར་གྱུར་པས། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ་མཆོད་པ་བྱས་སོ།
en: I was the daughter of a lord of the nāgas and made an offering to him of the rain from a cloud of kings of precious wish-fulfilling jewels.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མད་སྡེ་དགའ་བ་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བའིཤུགས་ཤེས་བྱ་བ་མདོ་སྡེ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Power of an Increasing Ocean of Delight , together with a million accompanying sūtras.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་རི་བོའི་སྤོའི་འོད་ཟེར་སྒྲོན་མ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Ratna­śikharārciḥ­parvata­pradīpa.

source: དེ་ལ་ཁོ་མོ་རྒྱ་མཚོའི་ལྷ་མོར་གྱུར་པས། རིན་པོ་ཆེའི་པདྨོའི་སྤྲིན་གྱི་ཆར་གྱིས་ཉེ་བར་བསྙེན་ཏེ་མཆོད་པ་བྱས་སོ།
en: I was an ocean goddess who approached him and made an offering of the rain from a cloud of precious lotuses.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་ཆོས་ཀྱི་དབྱིངས་རྒྱ་མཚོའི་ཚུལ་ཞེས་བྱ་བ་མདོ་སྡེ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called Ways of the Ocean of Phenomena , together with accompanying sūtras as numerous as the atoms in a buddha realm.

source: དེའང་ཁོ་མོས་ཐོས་ནས་ཡོངས་སུ་བླངས་སོ། །དྲན་པས་ཡང་དག་པར་བཟུང་ངོ་།
en: I heard it and retained it, memorized it, and kept it.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་མཚོ་སྣང་བའི་དཀྱིལ་འཁོར་གྱི་དཔལ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Guṇa­samudrāvabhāsa­maṇḍala­śrī.

source: དེ་ལ་ཁོ་མོ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་པ། དྲང་སྲོང་སྟོང་ཕྲག་དྲུག་ཅུས་ཀུན་ནས་བསྐོར་བས་རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་ཉེ་བར་བསྟན་ཏེ།
en: I was a ṛṣi with the five higher cognitions who was encircled by sixty thousand ṛṣis and manifested great miracles.

source: སྤོས་ཀྱི་མེ་ཏོག་རི་བོ་ཙམ་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ། མཆོད་པ་བྱས་སོ།
en: I approached him and made an offering of the rain from a mountain-sized cloud of perfumed lotuses.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་ཆོས་གནས་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་མདོ་སྡེ་སྟོང་ཕྲག་བཅུའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་སྟེ།
en: That tathāgata taught me the sūtra called The Lamp of Phenomena Being without Location , together with ten thousand accompanying sūtras.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Vairocana­śrī­garbha.

source: ཁོ་མོ་ཡང་མཉམ་པ་ཉིད་ཀྱི་དོན་འབྱུང་བ་ཞེས་བྱ་བའི་སའི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ནས།
en: I was an earth goddess named Samatārtha­saṃbhavā.

source: ཁོ་མོ་སའི་ལྷ་མོའི་འཁོར་གྲངས་མེད་པ་དང་བཅས་པས་རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་ཀྱི་ལྷུན་ལས་རིན་པོ་ཆེའི་མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ་རིན་པོ་ཆེའི་ཕྲེང་བའི་སྤྲིན་གྱི་ཆར་ཡང་རབ་ཏུ་ཕབ་ནས། དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་སྤྱན་སྔར་ཕྱིན་ཏོ།
en: Together with a countless retinue of earth goddesses, I approached him to make an offering of the rain falling from a cloud of precious flowers and a cloud of strings of jewels that had arisen from the trunks of trees made of all jewels.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བའི་གནས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ་སྡེ་གྲངས་མེད་པའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Essence of the Source of the WisdomThat Is the Origin of All the Tathāgatas, together with countless accompanying sūtras.

source: དེ་ཡང་ཁོ་མོས་ཐོས་ནས་བཟུང་སྟེ་ཆུད་ཟོས་པར་མ་བྱས་སོ།
en: I heard it, retained it, and did not lose it.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ལྔ་བརྒྱ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐ་མར་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའ་མཛོད་སྤུས་ཡོངས་སུ་རྒྱས་པའི་རྩེ་མོ་དཔལ་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Noble one, the last of all those five hundred tathāgatas was the tathāgata Dharma­dhātu­gagana­pūrṇa­ratna­śikhara­śrī­pradīpa who appeared in the world.

source: དེའི་ཚེ་ཁོ་མོ་ཡང་གར་མཁན་གྱི་བུ་མོ་བཞིན་མངོན་པར་མཛེས་པའི་དཔལ་ཞེས་བྱ་བ་ཞིག་ཏུ་གྱུར་ཏེ།
en: At that time, I was the daughter of a dancer and had the name Abhirāma­śrīvakrā.

source: དེ་བཞིན་གཤེགས་པ་དེ་གྲོང་ཁྱེར་དུ་གཤེགས་ནས། གར་མཁན་གྱི་ཚོགས་ཀྱིས་རོལ་མོ་བྱས་པའི་ཚེ། ཁོ་མོས་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལས། ཚིགས་སུ་བཅད་པ་སྟོང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མངོན་པར་བསྟོད་དེ་སྤྱན་སྔར་ཕྱིན་ཏོ།
en: The tathāgata came to the city, and when the dancers were playing music, through the power of the Buddha I rose up into the air and praised the tathāgata with a thousand verses. Then I went to him.

source: །དེ་བཞིན་གཤེགས་པ་དེས་མཛོད་སྤུ་ནས་འོད་ཟེར་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་སྣང་བའི་རྒྱན་ཅེས་བྱ་བ་བཀྱེ་སྟེ།
en: From the tathāgata’s ūrṇā hair shined a ray of light called the display of the radiance of the realm of the Dharma , which illuminated my entire body.
